#read design
read_verilog demux_4x1.v
hierarchy -check -top demux_4x1

#the high-level stuff
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library
techmap; opt

#mapping flip-flops tom cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#cleanup
clean

#write synthesized design
write_verilog demux_4x1_synth.v
