#read design
read_verilog trans_layer.v
hierarchy -check -top trans_layer

#the high-level stuff
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library
techmap; opt

#mapping flip-flops tom cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#cleanup
clean

#write synthesized design
write_verilog trans_layer_synth.v

